import solver
import numpy as np
matrix = [[11, 3, -2, 0, -2],
          [3, 14, -5, 1, -3],
          [-2, -5, 13, -2, 2],
          [0, 1, -2, 15, 3],
          [-2, -3, 2, 3, 14]]

test = [[2, 1, 4],
        [1, 1, 3],
        [4, 3, 14]]
test_b = [16, 12, 52]
b = [0.5, 5.4, 5.0, 7.5, 3.3]
test2 = [[10, 5, 3],
         [3, 10, -2],
         [5, -7, 10]]
test2_b = [20, 9, -9]
test3 = [[10, 1, 1],
         [2, 10, 1],
         [2, 2, 10]]
test3_b = [12, 13, 14]
x = solver.jacobi(matrix, b)
print("Решение системы - вектор х")
print(x)

 